38124
60494
56461
60106
46367
60775
79997
72664
66348
70292
24173
21412
45661
42701
35005
31663
42457
87140
40619
26330
89358
25744
51921
21523
48230
82583
61795
21267
73338
23226
68197
44375
80878
51367
36614
42508
75579
55805
27343
28708
83219
43246
43094
87799
72086
47685
20014
32448
17161
67557
78238
32819
34030
49388
81580
56867
25723
35923
67697
69988
66152
42825
82928
80687
35163
63965
51838
51455
38319
60929
38667
60354
37599
51467
42035
62483
38335
73336
51859
86183
26368
76156
62497
24914
30762
49407
65335
35900
30374
35758
36396
45519
54736
84956
32553
60675
40847
45645
65527
69037
56182
82337
39213
82522
75363
24818
31210
56922
18795
60912
54510
35293
62951
75067
68734
70595
34701
72718
41360
82958
49327
69356
77273
36028
54965
52944
41164
18171
38339
26623
71866
36668
61774
56265
79833
71529
22884
31521
39189
46202
73521
74241
83614
24331
7459
61999
65309
44362
48115
27784
28195
62772
34389
82887
44828
67302
63102
68180
39263
27811
44560
33943
26318
70525
88702
49657
45991
56739
86014
45532
79556
18709
17011
62881
41779
3136
35825
46890
67770
20903
81829
68456
58483
23721
32531
21973
53789
80715
42525
66514
73279
29329
40092
85736
51876
46079
66544
66263
77845
43397
52036
43914
77535
82540
59157
33727
74951
28550
45837
83180
70966
57760
25701
17669
29935
46612
43567
37624
62677
41396
73964
44607
83945
62398
68776
57588
30870
54711
35742
83104
86968
46785
32587
54539
72597
60073
44327
41424
27026
51789
25309
45158
23337
74265
51047
21653
79505
82587
24326
51073
28622
86456
20727
45087
87695
26854
62811
33835
50512
69577
59320
64307
37942
64442
26384
23631
51314
33955
49023
47948
47320
49448
47011
83512
29828
25573
17189
39203
48825
18570
24742
45873
54393
50047
29591
34983
68939
80945
34487
21725
86329
36545
88944
37108
47673
27606
59660
70274
72338
67133
47158
45543
87602
69301
47078
47545
69632
30255
82567
20020
63119
61204
82333
32969
46219
26796
42790
72245
47762
76030
54557
86218
59576
63399
56308
87429
34731
26654
38793
66656
79252
69950
37695
33476
68901
62498
32885
23302
79293
59122
45716
43263
86728
61764
61982
59207
18195
48847
73807
54063
25091
57102
55319
19004
28813
58066
77197
47013
45120
57477
74763
81737
20106
62039
40935
36550
39572
47109
36915
60523
44763
28198
36787
29530
27287
72819
87110
85811
86633
49323
83315
30905
34618
54428
9446
51653
31723
24076
82525
62158
73184
76152
27587
39955
41817
50521
81901
34338
44791
40017
10329
54186
83685
42266
86229
23468
31064
25915
67762
30661
66907
81012
43296
25058
87879
12519
37452
60963
52522
45097
13635
71484
52360
85356
52191
31092
83441
75080
72260
77910
36423
88110
59395
67169
87239
25028
78762
45074
44569
43646
40848
58208
66488
80983
67718
36472
42929
22110
81802
29459
78524
53619
52823
69201
44090
43398
60694
39542
45155
41223
53633
85810
86251
28127
51386
63483
42695
39960
74371
53458
41852
18381
51670
33469
60089
37478
28692
13234
44884
17859
54468
41095
36553
69158
41908
31886
33012
89338
69127
69102
88479
50081
46525
46447
36199
41071
78928
9276
68936
21629
74753
37704
24568
88043
66038
54867
60954
28696
60276
85975
32216
39713
33173
32903
37286
64792
46153
48382
66641
38057
50482
81198
25965
24352
81445
37972
81897
72844
22161
17180
33398
83757
66639
76473
80026
85334
70825
53307
63257
34371
27263
58743
29035
42491
20373
42031
26909
58801
50413
35914
58741
43900
27074
67582
56992
79003
61160
46510
45001
78856
39327
88577
77446
52220
45776
48902
41247
37374
49877
54862
34196
45707
48895
32496
38460
54007
70914
39284
69798
22970
61086
31791
33661
25399
42664
48862
34930
34502
34669
56692
29176
54720
31052
25506
44055
68354
54961
39937
77826
19526
32789
82870
29344
47251
43613
76084
38848
42411
69994
31627
86480
79595
23420
70081
82338
36728
36254
48443
40105
39728
45332
66334
45691
44998
63721
51749
75984
37109
59714
79429
41717
75661
41335
19947
46985
61195
28764
34355
86443
54958
56753
64050
56926
77268
48621
48372
60448
47423
54362
44832
38518
39666
55769
81974
44048
43374
42891
48181
46380
78751
39344
74500
31758
26978
42552
81278
56706
53360
48903
52784
24660
59782
74855
83073
58058
72651
30940
32854
75831
60535
59101
70126
73747
83878
45603
63765
40973
69431
75407
39534
64486
40728
65601
45047
63177
86080
71121
47376
70870
69734
27123
40321
33800
65823
72465
61720
74196
69922
34719
69561
25590
65035
45192
79102
64605
69358
55654
55269
65040
20123
43237
45596
70140
84316
87116
76598
79568
50616
74409
54033
48719
73446
74214
65781
27155
75731
89190
80648
41487
23030
54586
58489
29517
86911
37832
64881
45495
57524
22266
33816
78095
18927
74244
67036
66692
21600
51690
38624
49273
24950
57116
30366
26531
31835
54994
52694
85782
77781
67001
57727
64869
87927
23626
30995
35876
77284
43051
43019
37067
51014
40712
64979
70034
72057
45018
81895
54160
13518
30727
67514
66908
82427
49674
53520
16091
26100
31068
80545
41022
58615
58085
86146
58769
63915
52696
41377
60400
79646
43856
36911
25086
67494
68045
68891
43954
34134
27010
88632
53598
48594
43783
76110
53351
40605
57988
78621
30400
75760
44292
68784
37655
46115
38154
62786
65789
76333
41849
58782
40913
53080
18091
50347
89091
88037
69630
60917
34223
81702
33482
16250
33409
34957
56406
67115
39568
36727
39177
73787
87332
80582
77858
23477
43526
75296
11613
51774
18590
84899
79976
61061
86386
28074
34395
47603
64003
46850
78493
40489
76960
79148
67190
36390
30465
84821
58493
81938
34747
41893
60762
63076
47402
41202
40414
27017
80403
81134
29291
64777
60037
83774
69751
85873
82828
59770
49065
65064
41267
62390
19819
78809
81300
54200
59902
22068
46638
63565
39110
82208
30769
25072
34093
41302
79049
31334
29724
39493
75051
87196
48790
68865
39072
80160
24298
50344
85690
24618
33325
60745
56385
61300
35130
47414
46889
50664
33113
71931
38318
79227
75292
22961
49114
44389
86061
76630
86972
42775
43633
82405
25830
24964
66024
41816
45271
79683
39769
74077
50938
28269
63317
68131
74169
41032
83227
43961
89259
54367
62163
24741
49059
67905
87945
67985
70486
58807
15261
63066
31904
11379
48243
63167
39799
64640
35246
50326
43979
38136
44186
47898
40858
15426
32222
79668
50870
59608
55541
44670
63075
43117
35613
66673
65300
76390
61629
25657
53570
71713
79267
61955
67139
18532
41532
87708
44004
30088
55172
85237
59970
40285
36051
23074
12600
32729
32859
64588
86712
84134
44820
47928
76571
53225
31391
44895
48626
32180
37221
45685
39692
58206
35839
49031
80388
47899
16093
48048
52125
40730
69035
49637
88802
26824
32900
87727
29867
42241
41041
65715
68459
34238
51557
61223
62396
69022
60973
33218
58224
66380
86671
74255
64828
52992
29965
42704
73220
33925
72949
41411
49667
34684
64626
39879
38618
48873
36048
87765
81138
80743
34732
69605
68433
84603
55692
28788
42076
39699
19386
40346
13374
48605
70224
29498
38024
28388
80909
47417
63268
51830
60257
80027
63039
40538
58760
66499
56284
55352
50820
38876
42872
64901
17261
84431
49889
77016
40139
77662
68362
82586
43925
45435
68113
53811
57247
51193
59788
63325
11005
32803
31423
85925
24129
70931
52995
78609
39191
30745
65859
57939
41498
61660
53387
46170
77445
64114
32083
64684
59678
32547
63930
62880
40693
47533
42942
55381
87225
34581
16818
42756
39407
60399
79777
34209
72420
45557
35859
80850
21499
54247
43566
41847
80201
67765
27532
31556
65649
52791
80889
89386
7233
57637
5326
55421
81864
61595
40766
41670
70572
69324
35581
57620
51524
70512
37582
61612
38467
50080
31659
44021
23810
57322
52411
39242
56416
48416
65549
53452
48015
61892
79341
88603
43074
45713
28728
84813
80822
26440
37713
42556
54529
89387
38682
77811
26613
38139
45779
7175
52451
55929
48736
68842
86045
55300
48817
54800
51085
24763
84621
51287
31986
37932
71190
88119
36662
45492
24212
85402
50020
40434
12844
79902
50802
49845
86943
46493
56630
34283
77389
66552
41887
37399
28050
77786
59621
61684
31276
79874
70815
36777
54126
23517
39889
86338
36040
64726
29760
44472
29809
61699
63782
33640
49711
30874
34332
33232
60125
39890
45064
89207
56338
19411
48112
42659
25898
56102
86362
41636
76936
34256
66990
45222
54842
33283
42151
23269
51499
40786
48816
30274
25502
66778
68204
75218
66981
36507
82092
39323
24521
76955
66968
45095
79677
83980
63111
21359
33354
59030
84756
73237
32023
25840
33649
22767
89038
52061
73070
69597
54972
37179
86839
74752
75391
68515
75816
78643
73867
81666
59022
76319
39566
23231
66435
41044
79248
73653
45413
75962
36961
39143
88871
53056
33464
23051
57612
84599
88743
59061
29018
68275
14427
84696
28288
80158
22979
58724
87020
58881
43678
61789
45958
50629
49939
45322
41162
58275
74709
44045
34050
32018
64680
56318
65260
57474
69481
86236
74702
34058
51239
58400
62393
33906
25437
41606
34007
63359
84978
76285
45481
22749
76120
66232
50494
70958
71802
64976
36971
64329
77248
59847
12030
11711
76579
63977
14702
68392
36735
79075
36593
68760
76243
23037
86441
88995
88734
44751
81040
80032
65032
84962
50068
36456
71527
51525
31493
81094
74357
58020
45273
56121
73400
58842
57176
84945
47879
30802
48480
80847
89103
66635
86075
67538
45339
82258
33655
88856
53228
39035
49290
87639
78232
32474
87369
47388
23005
65511
30750
25971
88132
63221
83751
31991
33020
80409
39855
73872
42852
64848
38466
53794
48229
16084
59307
82589
48958
33045
22597
32010
69816
45773
86605
47278
42590
54161
38875
49477
9672
42650
36069
25663
40815
86197
84193
46614
75383
53712
76066
3451
73431
76438
75510
69424
72704
29426
75756
46767
84123
83446
84617
37839
83602
86811
27014
31112
84858
81962
80161
42830
17531
56027
88879
86437
49693
28082
60105
34351
56334
72173
18014
85271
30484
69722
56514
60142
67103
78496
72875
81618
62606
49767
47854
45170
68767
32433
43182
45845
19639
73689
49372
48281
58156
86726
29228
3123
62695
27654
46866
55218
84240
57199
39324
63431
51945
49786
35265
18871
43818
76467
35811
56346
22409
84588
20468
76060
29033
45122
88645
88848
44948
28824
65523
38137
64749
76162
18981
63469
60378
49660
65947
71373
48463
35501
57775
37329
67478
35820
66141
75165
49864
74653
78418
70281
60728
76993
45856
28374
39645
23266
86380
64237
44246
78239
59056
28803
40253
25602
66823
46881
38296
62532
58034
81291
36488
59174
32597
68119
82997
25152
53015
88240
74028
49601
61842
22321
68008
30262
69003
48271
47340
58340
76792
44394
49998
28312
48650
88039
76360
69123
45423
23055
28624
20607
47942
30833
58392
65005
87529
29640
39749
73178
60857
44112
71653
75538
81808
51305
49624
49812
47277
77832
62222
59893
66285
31081
30520
60269
14028
38761
46011
79000
89160
33413
83874
75216
48712
18700
27611
41525
25703
44730
20364
75911
84753
46047
52999
63787
88276
32341
40046
78807
37439
26038
82443
15294
30170
40426
46045
55558
45488
85518
43465
44031
48134
40288
35668
84905
48026
36139
64126
78841
57150
61865
86644
34001
42896
48399
36515
37805
47281
75850
64030
62019
56159
79879
74895
35070
45636
76266
53050
25273
3485
47000
24126
29666
29452
22202
35219
39797
67842
25980
33527
31383
51091
43590
46912
42229
75887
24694
58921
47396
41980
24830
40236
47282
69763
40692
48202
24525
88383
43807
83283
76709
60137
85938
78835
38620
82783
61560
45093
49380
54657
81235
50927
59353
36006
56722
38859
38496
30492
19597
36286
54023
79118
40878
55089
25941
66537
51540
25341
38074
27056
47301
76875
47009
87049
34899
89168
70516
44728
79073
58474
50205
45360
64813
58827
84674
51436
27460
37486
86423
27541
22300
37521
67240
77879
36025
67980
69089
56344
64141
42646
43400
50692
73256
54716
49130
74410
65998
75481
63084
45975
39943
71388
75327
33815
64203
68881
29994
79692
48781
40806
66586
55523
29930
40597
60517
30235
49802
39337
59110
66827
88246
35378
86278
80485
31957
34374
37904
68687
42144
71594
35242
64898
43087
85609
35649
75562
73517
58993
62252
48385
40562
43301
37205
85348
28884
52975
74822
73567
31386
36187
40417
71158
56133
28188
87247
58821
41534
25292
89484
36440
59453
72822
80461
62536
78057
40800
49104
66663
47047
68442
34066
38671
18946
66921
46728
56752
63500
88190
88319
80740
57289
84689
49264
66486
78030
32852
70718
84534
48077
52068
37674
61986
35377
82097
74058
83471
76625
69604
64277
49305
31548
76109
41601
45630
42356
61105
89349
23877
23020
76389
44130
61872
83877
52460
25168
75018
75290
43649
48628
58558
75683
89407
68953
54307
37929
42185
56446
51755
57606
33301
59126
66137
38449
59763
74695
78264
73630
50490
39992
31026
77556
41479
32974
26299
15152
72158
32376
51948
54840
79574
82865
68167
25246
57911
73343
83622
67540
71814
42914
56940
72506
77254
10050
33660
76768
70150
26345
40184
78135
33575
36974
71963
39119
31400
79451
39146
66808
74584
34716
73271
43803
81718
73875
50166
32980
34195
41535
84996
60875
41800
46220
83872
33896
39050
39353
42565
54857
82949
65872
59161
72230
37073
82642
21609
37750
87344
23090
79382
44658
53255
19753
79099
15295
45438
32800
76872
87218
33348
53210
30261
64876
12918
80023
46548
65038
49716
38950
88893
82695
83944
52092
40545
69963
44484
78045
87177
41892
58707
46206
41669
81692
8297
80226
21571
73278
74743
47733
62832
77850
50116
74757
42683
46156
46442
41489
66043
61521
30190
35759
63488
45473
59012
84700
61467
11239
43551
53916
45289
46252
42121
48918
48699
67445
59798
56032
40916
42605
39963
64493
37793
45203
36731
32400
78099
69285
83884
22320
39896
44086
37316
71177
41233
74601
80866
34939
25206
31413
26281
67294
53471
65386
72214
19849
54071
66693
63865
61277
37543
28533
72482
71392
49859
67479
67028
40721
39882
22076
36293
75901
21433
87969
63994
41861
73187
61862
59410
39162
63435
31331
21613
70471
39924
43955
74197
36012
46544
31370
37458
40915
60613
88689
27362
86764
38664
57640
34636
86788
77355
82142
46661
77411
72547
70582
39205
88239
48240
42573
76047
67554
62143
74814
40361
39003
48140
42898
53153
42383
68615
33167
20221
52956
88579
62618
57975
43433
84447
78718
26626
11712
43373
42668
44778
73878
83345
66886
38883
77851
56464
46035
77263
26999
55740
56393
84001
57349
73102
43848
74792
67813
85493
60065
48672
43236
58282
87645
30223
73469
32633
54042
40080
56011
74064
44839
78570
27554
39215
78361
25113
59755
42821
63684
54894
63921
60536
80071
57252
50582
44035
82455
75939
78947
79804
31013
22738
45579
59489
73145
85241
69995
31008
38422
44804
60547
87056
49058
45137
62735
57153
27089
80618
59610
61969
46343
68862
59483
47362
45869
34463
46778
80730
43534
56686
66741
48557
66559
29726
67537
44473
17329
69571
65403
33884
45621
62219
28883
74592
52577
78816
64274
67716
34005
43185
65992
83106
52081
43332
86265
87390
59533
49123
44783
47344
37213
21508
23580
48114
58097
33056
67157
20691
45831
34996
85287
35175
61439
83440
54632
31598
65008
78052
77950
24470
87266
21266
44536
80007
66248
43402
81285
66502
73900
84773
26760
52636
71247
76755
49102
54302
48690
22937
73334
87532
41613
31060
70249
59021
79729
32382
38305
48761
42074
67816
62308
18899
25661
47330
70759
3533
36134
46134
54479
54944
24463
76132
33704
76791
54243
29445
45615
62778
38517
45309
47105
70569
45139
67041
63454
88737
24888
32611
81029
88198
82096
58648
20363
34198
83697
68380
53481
49030
83216
57447
78480
61557
62488
33001
53563
87888
85853
44859
40547
45246
82559
34606
38962
63678
33731
50175
73707
36878
54029
37711
27408
52082
55731
55328
38560
68184
16018
53492
67928
69487
30556
32982
29036
83335
23019
25924
76637
38727
79125
84686
80045
30408
30728
81894
42694
15694
32118
30052
25081
11248
12145
17967
8957
21154
40071
52536
87340
62154
7028
6621
7262
78670
52419
76321
30718
37187
77313
21811
22642
59806
27485
26757
32134
31626
20882
33094
86957
40509
31325
20420
3546
2278
49568
89042
73176
73202
35993
26549
72466
34535
344
49148
26463
37409
82466
31716
65037
85162
15303
5046
58393
67824
73014
33829
45251
74230
11237
7527
35904
42748
13805
48624
27145
46048
44604
11856
31355
24812
66543
38902
3524
62170
73835
44555
37155
26052
77566
26884
32278
3285
4388
62083
37175
11357
29592
45207
22604
60208
30985
24933
54816
33635
33694
33357
65934
33261
31049
79010
27341
27964
12349
47848
40755
44564
3628
42941
40201
27985
43902
44577
66810
65619
11309
29532
39702
45304
32399
32476
46279
60577
66549
22436
40661
34563
62638
74991
24455
53037
71590
66287
58221
76298
46898
50006
55959
40307
88116
22844
36013
27839
37369
21535
19037
38028
73138
86113
3477
29636
29432
14258
45189
68792
34710
68639
43478
54693
43021
45509
29088
37733
35510
25981
24932
30195
27461
50560
22513
82320
45569
41869
74270
40896
56177
76048
35863
74876
30370
17652
40118
42900
19551
2947
33667
27957
20397
47957
12533
37955
33086
31269
44111
36340
26065
69892
34525
21408
31019
35448
6568
41982
44219
6571
46284
58354
62043
16331
38796
42662
22917
7670
13279
23220
51056
46425
79054
78962
57541
9168
34786
3671
13860
69954
31358
26964
34188
36776
28251
46636
35908
60391
47727
21800
30341
33618
87707
26666
38972
24308
12020
6241
24432
45447
41304
30315
53996
13981
87051
31852
34350
27398
8972
55237
41935
17348
22383
61719
62266
33563
76756
64973
67501
71313
13995
43693
6174
29584
74256
24596
30990
50355
57480
7126
67337
20565
16023
30916
42500
61513
66034
58191
56623
73313
50939
57172
67306
44775
13806
41542
32543
56708
34494
29690
14075
17873
13302
86819
38872
41872
24677
80644
9440
69789
15967
26743
5334
76821
62226
72443
72142
19185
63564
13450
38845
2075
75671
49192
11933
29602
22825
22031
38718
48504
40912
52925
25974
25484
20372
7574
18115
16304
26238
8076
9079
407
34033
75684
20423
48132
27125
11585
41467
38541
23244
12929
31198
72935
82970
39627
50491
16634
79423
34968
78603
23995
23985
81995
35688
26837
24931
69407
48597
42402
88724
19953
19644
67684
49348
85639
27053
7594
13904
29549
40898
21836
37402
87761
75118
54298
26636
35071
20157
43278
33275
37945
62943
74943
10657
55320
79553
16647
29663
28832
10365
39393
49468
51912
29081
77896
37705
37204
39097
11099
36419
6999
54869
82066
88996
60801
84433
76012
69956
46690
32860
14346
57591
72551
47247
86946
76926
29094
44969
80686
29208
37921
33585
40550
80954
44937
8711
14459
34027
23533
63025
37571
29230
75629
1505
60510
34838
28868
52765
48821
83703
67346
85303
43545
29372
9746
32656
39112
45215
13464
67017
54059
813
72984
25208
70915
85397
19154
47106
27161
37743
9519
27339
56749
15708
67504
42822
7579
18572
55316
65653
80314
68005
24646
13772
80351
73632
22566
4083
868
69479
31263
23435
82681
27240
30151
28182
77323
40861
35694
46738
32837
23228
66096
78562
36266
75786
36568
20815
32877
31456
59761
85280
15379
27510
51391
23962
14475
74421
17042
68638
39526
25507
10522
43487
37487
53440
30404
36742
9158
36659
25071
83304
16351
41486
12776
26925
72136
43492
45756
69974
41837
32971
9004
68283
25926
21562
76171
41565
24863
11095
44692
47143
23746
5078
37956
71561
46249
2094
26560
23201
55073
32829
44975
11890
34950
4400
45297
30491
59298
5908
2187
33505
18623
12341
12793
3415
28493
42173
57751
11410
35092
72987
5245
14971
31085
34726
61619
87721
19608
23997
32552
43662
41330
12396
82616
79397
24976
45424
18458
36956
30181
32036
64101
21589
52871
70674
82814
35519
77585
31359
427
32008
37605
63339
31816
50543
38608
26059
41858
32149
25100
42231
9379
37774
33388
34975
26304
67217
18158
35277
49629
59033
19920
25622
48573
70133
28121
45818
34637
3380
39824
61452
32732
25306
18711
7575
42287
22771
24499
37461
7177
38557
48872
43326
18343
64741
1897
40179
17941
55778
40540
10612
22340
45365
24789
1173
55824
46879
39103
29270
11194
61658
13822
40798
73406
28011
4755
39149
6504
53824
8743
86667
34779
76481
37735
60377
70731
34638
47880
42227
36298
3850
38835
32184
41305
73537
79781
87680
76806
22829
44089
10253
17290
24356
31883
45187
85542
43352
22044
25603
22787
48525
34744
33170
69312
74150
37653
61074
5009
43443
47513
43710
38704
51647
33040
36949
23472
25307
73581
83426
72641
18491
73781
439
27473
19755
37154
29109
48556
41915
63689
41049
39801
28339
13121
43760
32972
16470
25925
61479
80108
30780
4705
28775
34408
67530
27535
42083
65561
17032
37758
17575
70378
55248
50754
39009
27959
20366
63321
50475
54399
47167
27157
2252
79338
49863
46248
20671
2563
37579
19767
83278
48843
41181
40020
26592
34271
21357
85983
32157
11720
21334
28502
13367
17499
34856
63674
76405
18556
24567
30413
37065
79877
32884
21982
24969
47694
21379
4222
28145
37463
31467
48167
80390
17408
18330
11157
26379
27895
86830
50488
36612
15517
19645
24758
47289
6114
21466
85820
22357
23594
79521
19925
58587
50016
80172
19954
19340
35202
68903
46618
41003
29931
37845
30398
14766
59498
3516
30584
16236
2362
50641
49137
9992
37050
43812
47030
26763
32685
26103
54090
24084
2467
27443
26546
69692
38847
734
54828
31014
19161
66452
33016
9978
34375
41664
74057
83294
29323
39591
34664
3979
32759
70232
27447
1956
68594
39679
51787
20708
74327
76094
13066
21100
12340
69454
11345
18277
12926
22136
40452
26984
8013
71994
7943
64253
14494
74099
6329
10327
17788
25823
3942
34442
35807
28458
49589
66714
15891
2006
81355
71613
78447
35695
59192
67769
30301
74946
39207
26282
5858
9617
88189
1814
19277
39675
26439
1456
32818
32613
62503
27615
49294
88754
69000
49302
47732
18463
59779
87857
31130
6082
24523
36322
3055
6680
25219
36450
81416
42952
78886
14411
10687
2694
36516
34341
23050
4401
72287
42168
26182
3720
39288
40930
45809
50171
7504
84706
85078
72180
38994
62369
40484
22891
43950
9720
11573
56632
38209
40910
71650
76332
25269
9889
22310
27462
4620
36087
12029
84029
25880
8273
11459
15658
88828
82017
24600
55153
39926
28554
45590
40441
29564
21649
45932
33986
88091
8305
74972
48737
78661
32503
10044
26225
62801
41514
5084
37855
41203
24036
42061
64968
75824
51907
78802
37554
19451
17342
85511
40695
83892
24410
16668
32626
32338
22693
23673
41895
26334
22430
83853
36619
9684
9862
10571
45913
11177
18204
2458
31422
44583
16718
20638
38755
57707
66478
14058
21189
44535
71478
16375
40696
53493
16622
36405
10386
47958
9419
31075
12674
27248
49544
69519
34555
39820
19542
84078
40305
68506
47923
69476
15317
21532
53560
27064
34133
4380
39250
36053
84568
10093
59176
83306
45185
12078
12962
15779
29406
85445
32418
50559
49225
30030
1338
31024
28901
11745
9150
41134
2256
31202
7909
4067
7499
17985
32364
41553
21919
24908
24348
76414
44571
14274
60469
33221
23082
37905
33923
84787
1020
24229
52754
33342
3152
897
4757
25130
267
81776
47900
12514
32529
39563
33153
82944
30740
47230
39935
24049
59643
3934
27189
37990
31150
25283
82975
11013
81857
35068
32892
27850
84513
64947
40897
12361
40554
29358
36783
8574
19199
68438
27020
31571
80382
49227
21766
38559
16017
10697
37825
78369
58624
30483
25509
24916
2421
6584
48099
89285
70675
21625
8629
3424
41736
87468
24873
30489
33628
40975
49050
60047
44624
40430
31288
59010
31282
13687
59364
35196
53553
17025
50665
16877
39054
8278
3456
51095
78071
30407
17770
23825
11029
4666
76989
32812
19660
66051
49946
14864
36369
21639
57487
61750
43300
37254
51149
42693
33160
23077
1103
66501
83568
23992
56280
4152
47991
37362
40703
40797
41015
82266
38737
26139
43112
30375
31694
68243
56549
19293
28486
33480
24475
82706
2120
14412
42005
71962
5679
49386
32838
46532
61533
24833
42334
21007
34947
70614
36486
37385
42967
45399
39795
82883
15326
31811
69423
27277
65828
22194
77329
11486
50364
26230
54673
47115
45116
36026
27923
77925
24190
46787
28570
34103
10686
21842
14431
58189
34712
58818
14816
23444
69279
38441
81436
25687
31489
80136
12658
86335
44250
47622
4323
12011
27963
26254
45325
55999
77283
16329
54790
953
15882
8482
19480
70009
56571
86884
80248
22197
44920
20934
28346
47549
59985
64364
38363
20709
36850
13670
18763
19593
14906
18255
86567
36649
49364
33624
45033
15645
51048
89435
70772
15051
1270
19994
22848
49856
24040
52272
28606
41198
10654
35745
15533
44595
1606
28462
69682
12337
4953
57011
36120
64245
55935
86983
37519
53892
21780
40613
31990
45759
13579
17638
82629
15458
22757
2068
30500
23432
25210
38202
34077
67335
44157
40068
14023
5028
23591
19024
43940
24608
39156
18499
19658
70091
14591
53272
6344
41812
57171
84495
29771
62996
62464
12752
24506
7967
74838
38384
72741
9937
52333
3335
21035
38576
48187
17663
71804
33210
81553
63639
25685
35425
80413
24720
39081
16103
33436
62751
18947
20605
79456
56044
5686
87754
71552
42267
48224
11362
66749
14805
14823
57609
25160
23822
31374
69866
82912
47827
25477
14104
84670
47374
10172
14003
30399
26482
42712
10302
85515
7837
27849
18550
82938
49466
37756
89328
48765
5883
54081
40671
83334
2689
38458
66178
17034
44894
22796
24411
78061
30369
63558
43325
25957
2751
24725
84437
39095
75716
43143
80133
42024
38542
35007
17421
9721
18627
74009
44259
11904
52039
42456
55168
21158
16979
38631
40374
30271
44175
41648
48912
73453
28957
34104
60576
373
17136
53462
35470
63116
14480
24280
87104
15518
20929
18128
14498
42577
43307
38258
39558
24772
50729
23445
45855
45463
21369
42316
68531
88422
23427
43384
23720
87243
30372
44990
25636
48670
37503
27704
86199
65147
83101
22040
19089
22083
33419
26370
33833
19821
55201
53324
48184
9513
35917
8536
55587
50317
36089
67941
18804
25490
11893
50739
42921
43490
15802
73597
46737
8586
4789
25734
6585
45128
43147
53373
45892
31040
47634
38454
42320
71991
35591
37526
43334
9860
51284
21825
78013
581
20564
47891
19687
53589
78550
47905
73159
5270
62662
62966
21026
79611
2299
34900
15439
30242
29610
64023
38409
83204
35709
43183
47287
26807
25748
52565
88420
23430
60158
17791
3135
50403
65594
42163
30800
21345
30209
37641
36654
60883
28355
48084
13063
85871
9490
18181
21569
20580
4280
35249
88774
15889
85250
24982
22618
66128
29873
29427
88156
70413
74425
62913
29752
49333
61829
16064
19400
71465
26305
7790
86137
13560
35399
47776
67047
73124
59023
18856
40228
5987
25899
31728
35813
29806
240
30998
80937
20558
44316
79348
19870
50196
32704
34172
45629
40013
30629
20515
31754
88641
16403
10344
51632
21235
36671
43231
12121
23111
69090
23717
70943
74853
6395
26168
27078
44591
86650
24615
23909
53539
28666
10301
48273
24373
69252
1479
64196
25857
25620
48956
66875
43084
25534
13219
76839
37260
53250
36675
32630
33718
70962
11791
49630
24906
60324
43251
37347
52521
18218
49600
5251
45752
32497
30566
44514
49606
44589
35913
9732
66936
12151
41741
13881
23695
49480
9425
25123
31222
70024
49184
46289
54224
61968
39794
58468
37761
6862
52470
47807
20668
26832
36709
49598
45885
55321
16636
36562
15622
31947
67532
80676
42215
78021
23480
83686
43886
86603
87099
363
27409
54470
48798
24303
35107
32403
18079
39495
17313
12874
12778
47500
78817
52122
51612
27880
32093
31614
25829
19385
67920
7937
58524
26689
18615
8161
27631
38722
26438
85377
41442
84025
34431
1627
47875
46056
14744
2709
38020
32001
40398
23249
5845
49232
14155
81951
18934
34049
43779
88347
63774
18870
15141
22427
76952
38158
55666
37856
25580
15730
5207
25241
77929
44711
39102
38128
45052
79557
5749
61713
25511
1527
17302
84125
39201
33470
28134
47216
18361
46657
44424
16598
22862
16813
30487
17337
63199
51747
13942
30530
37525
35563
45555
62732
10830
43775
11823
45600
27579
58668
36732
41572
17764
74341
80414
11602
74742
47448
11366
36269
45406
9747
28891
21365
43620
57979
3500
34012
48426
85744
34315
19345
17879
71148
23369
6658
10242
48394
64310
77428
69642
46674
48104
23546
43458
8556
23918
19414
45259
38619
29295
28003
59984
21228
34430
20375
71855
40726
31799
24458
40541
1016
71329
2922
38106
5244
54366
63712
33533
64440
34537
17423
39871
33391
64266
46417
3450
23493
35732
69412
36799
83388
57509
12726
23359
72024
56756
23221
65854
44405
59590
48516
39957
13261
2443
22185
77468
44897
48174
25463
18163
53947
56271
52789
32942
66139
41757
35889
31490
28783
46397
33244
52732
40705
84087
34954
85691
44440
9107
53238
60219
17715
45290
41579
68624
40073
35780
26213
59240
24865
23211
17021
31010
30844
35396
43967
32523
20293
59474
5375
64168
20905
81279
42532
41174
44445
42545
44202
26040
23139
46867
29978
43863
12023
38721
36685
3284
49888
5780
85244
12802
73394
77
24935
35113
30966
7619
57412
51490
57778
51523
72350
38822
37827
22851
21992
29437
36870
13619
81917
38439
28073
17970
32103
63866
28366
76078
16482
38990
34850
12636
34036
24287
20437
22777
30367
56381
28927
31618
26630
68824
34318
61569
8109
32444
34243
34795
30946
33767
23903
71222
59390
38834
23267
88435
28897
88793
60143
13284
25919
16759
19830
35538
23686
30212
598
38913
4347
32920
18118
37210
19752
83899
85800
52854
40864
19741
29748
29871
40577
37390
42972
11225
52722
16761
16110
43834
49725
86286
58209
37006
44954
1014
2996
49373
86300
34257
7888
30850
69860
45408
35083
78251
11994
49776
88847
33762
8894
31140
57776
15718
24062
55877
2289
5466
12016
22730
29552
47541
19950
3406
33666
40150
56734
49454
18336
53270
40168
21595
59039
41687
40993
62439
17747
35440
22872
4153
39682
61306
7662
34072
18416
46804
26716
23826
62202
74010
35527
24767
43004
85423
59150
10130
28026
18730
48845
28623
64094
25751
67789
66268
65908
85930
69490
50989
70443
33152
83217
62449
39295
48952
9801
88149
27571
6277
27890
26759
15399
87258
50957
38650
32202
29868
67055
36137
77875
28811
13496
28938
38251
13719
6215
20840
54454
49809
87307
80539
77459
23792
14798
691
33088
19442
28929
44064
45706
87155
47046
50718
33489
59546
79790
67800
76548
31283
11141
23318
63596
28362
35424
30958
32874
14651
46179
60398
28627
56397
75019
15519
39485
21030
19222
63909
30322
82056
47345
73884
48518
33371
61949
41364
34666
63569
85949
5767
31795
17692
15595
19259
80058
31411
73784
2427
41496
62869
62989
52734
78204
26207
9707
35473
28629
24249
66747
30122
41702
33453
5517
50262
15350
18424
54386
79629
49842
33266
31597
37670
47258
38072
14316
55639
19861
49125
43169
76569
23447
19357
88762
3939
19010
3237
11384
61726
59451
34530
40418
20981
36773
768
84974
33330
21813
6952
13059
50400
48367
33902
31007
30965
78540
51732
15184
24936
39898
17388
8247
32936
40965
13235
27791
85171
46916
36926
31066
26105
56519
40849
57585
76233
69720
77796
79345
35014
14506
75192
58094
83130
36082
26535
5070
36363
22021
13238
45141
32607
42200
25422
54355
63584
60549
32659
15987
38750
45765
24605
2290
43284
73418
27280
31270
20090
26840
48949
33991
88310
8699
77144
43826
81741
25266
74043
8731
32223
55821
5465
72437
26775
41177
43154
41829
23246
38954
38159
5221
61664
66342
47411
60586
3182
12427
72299
40102
35294
67553
44814
8605
38821
11206
35358
13761
62760
41137
22104
69822
19467
38146
49791
78411
30791
31100
1179
65495
3768
40018
63551
52159
32861
80836
6782
